# 本章节主要说明Python的运算符。举个简单的例子 4 +5 = 9 。 例子中，4 和 5 被称为操作数，"+" 称为运算符。
#
# Python语言支持以下类型的运算符:
#
# 算术运算符  + - * / % ** //
# 比较（关系）运算符 == != > < >= <=
# 赋值运算符 = += -= /= %= **= //=
# 逻辑运算符 and or not
# 位运算符 &  | ^ ~ << >>
# 成员运算符 in not in
# 身份运算符 is is not

# 运算符优先级 :
# **	指数 (最高优先级)
# ~ + -	按位翻转, 一元加号和减号 (最后两个的方法名为 +@ 和 -@)
# * / % //	乘，除，取模和取整除
# + -	加法减法
# >> <<	右移，左移运算符
# &	位 'AND'
# ^ |	位运算符
# <= < > >=	比较运算符
# <> == !=	等于运算符
# = %= /= //= -= += *= **=	赋值运算符
# is is not	身份运算符
# in not in	成员运算符
# and or not	逻辑运算符




